app/Controllers/Display.php

    public function getData()
    {
        $ticketModel = new TicketModel();
        $deptModel = new DepartmentModel();

        $serving = $ticketModel->getAllCurrentlyServing();
        $departments = $deptModel->getActiveDepartments();

        // Group serving by department
        $servingByDept = [];
        foreach ($serving as $ticket) {
            $deptId = $ticket['department_id'];
            if (!isset($servingByDept[$deptId])) {
                $servingByDept[$deptId] = [];
            }
            $servingByDept[$deptId][] = $ticket;
        }

        // Get waiting counts per department
        $waitingCounts = [];
        foreach ($departments as $dept) {
            $waitingCounts[$dept['id']] = $ticketModel
                ->where('department_id', $dept['id'])
                ->where('queue_date', date('Y-m-d'))
                ->where('status', 'waiting')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `department_id` = '6'
AND `queue_date` = '2026-05-11'
AND `status` = 'waiting'