app/Models/CounterModel.php

SELECT *
FROM `counters`
WHERE `department_id` = '6'
AND `is_active` = 1
ORDER BY `name` ASC
---
    public function getCountersByDepartment($departmentId)
    {
        return $this->where('department_id', $departmentId)
                    ->where('is_active', 1)
                    ->orderBy('name', 'ASC')
                    ->findAll();