app/Models/DepartmentModel.php

SELECT *
FROM `departments`
WHERE `is_active` = 1
ORDER BY `name` ASC
---
    public function getActiveDepartments()
    {
        return $this->where('is_active', 1)->orderBy('name', 'ASC')->findAll();