app/Models/ServiceModel.php

SELECT `services`.*, `departments`.`name` as `department_name`, `departments`.`code` as `department_code`
FROM `services`
JOIN `departments` ON `departments`.`id` = `services`.`department_id`
ORDER BY `departments`.`name` ASC, `services`.`name` ASC
---
    public function getServicesWithDepartment()
    {
        return $this->select('services.*, departments.name as department_name, departments.code as department_code')
                    ->join('departments', 'departments.id = services.department_id')
                    ->orderBy('departments.name', 'ASC')
                    ->orderBy('services.name', 'ASC')
                    ->findAll();