app/Models/TicketModel.php

SELECT `tickets`.*, `services`.`name` as `service_name`
FROM `tickets`
LEFT JOIN `services` ON `services`.`id` = `tickets`.`service_id`
WHERE `tickets`.`department_id` = '6'
AND `tickets`.`queue_date` = '2026-05-11'
AND `tickets`.`status` = 'waiting'
ORDER BY FIELD(tickets.priority, 'priority', 'normal'), `tickets`.`issued_at` ASC
---
    public function getWaitingTickets($departmentId)
    {
        return $this->select('tickets.*, services.name as service_name')
                    ->join('services', 'services.id = tickets.service_id', 'left')
                    ->where('tickets.department_id', $departmentId)
                    ->where('tickets.queue_date', date('Y-m-d'))
                    ->where('tickets.status', 'waiting')
                    ->orderBy("FIELD(tickets.priority, 'priority', 'normal')", '', false)
                    ->orderBy('tickets.issued_at', 'ASC')
                    ->findAll();

SELECT `tickets`.*, `services`.`name` as `service_name`, `counters`.`name` as `counter_name`, `users`.`full_name` as `staff_name`
FROM `tickets`
LEFT JOIN `services` ON `services`.`id` = `tickets`.`service_id`
LEFT JOIN `counters` ON `counters`.`id` = `tickets`.`counter_id`
LEFT JOIN `users` ON `users`.`id` = `tickets`.`served_by`
WHERE `tickets`.`department_id` = '6'
AND `tickets`.`queue_date` = '2026-05-11'
AND `tickets`.`status` = 'serving'
 LIMIT 1
---
    public function getCurrentServing($departmentId)
    {
        return $this->select('tickets.*, services.name as service_name, counters.name as counter_name, users.full_name as staff_name')
                    ->join('services', 'services.id = tickets.service_id', 'left')
                    ->join('counters', 'counters.id = tickets.counter_id', 'left')
                    ->join('users', 'users.id = tickets.served_by', 'left')
                    ->where('tickets.department_id', $departmentId)
                    ->where('tickets.queue_date', date('Y-m-d'))
                    ->where('tickets.status', 'serving')
                    ->first();

UPDATE `tickets` SET `status` = 'served', `completed_at` = '2026-05-11 01:08:34', `updated_at` = '2026-05-11 01:08:34'
WHERE `tickets`.`id` IN ('1')
---
    public function completeTicket($ticketId)
    {
        return $this->update($ticketId, [
            'status'       => 'served',
            'completed_at' => date('Y-m-d H:i:s'),
        ]);

SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `queue_date` = '2026-05-11'
AND `department_id` = '6'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `queue_date` = '2026-05-11'
AND `department_id` = '6'
AND `queue_date` = '2026-05-11'
AND `status` = 'waiting'
AND `department_id` = '6'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `queue_date` = '2026-05-11'
AND `department_id` = '6'
AND `queue_date` = '2026-05-11'
AND `status` = 'waiting'
AND `department_id` = '6'
AND `queue_date` = '2026-05-11'
AND `status` = 'serving'
AND `department_id` = '6'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `queue_date` = '2026-05-11'
AND `department_id` = '6'
AND `queue_date` = '2026-05-11'
AND `status` = 'waiting'
AND `department_id` = '6'
AND `queue_date` = '2026-05-11'
AND `status` = 'serving'
AND `department_id` = '6'
AND `queue_date` = '2026-05-11'
AND `status` = 'served'
AND `department_id` = '6'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `queue_date` = '2026-05-11'
AND `department_id` = '6'
AND `queue_date` = '2026-05-11'
AND `status` = 'waiting'
AND `department_id` = '6'
AND `queue_date` = '2026-05-11'
AND `status` = 'serving'
AND `department_id` = '6'
AND `queue_date` = '2026-05-11'
AND `status` = 'served'
AND `department_id` = '6'
AND `queue_date` = '2026-05-11'
AND `status` = 'skipped'
AND `department_id` = '6'
---
    public function getTodayStats($departmentId = null)
    {
        $builder = $this->where('queue_date', date('Y-m-d'));
        if ($departmentId) {
            $builder->where('department_id', $departmentId);
        }
        $total = $builder->countAllResults(false);

        $builder = $this->where('queue_date', date('Y-m-d'))->where('status', 'waiting');
        if ($departmentId) {
            $builder->where('department_id', $departmentId);
        }
        $waiting = $builder->countAllResults(false);

        $builder = $this->where('queue_date', date('Y-m-d'))->where('status', 'serving');
        if ($departmentId) {
            $builder->where('department_id', $departmentId);
        }
        $serving = $builder->countAllResults(false);

        $builder = $this->where('queue_date', date('Y-m-d'))->where('status', 'served');
        if ($departmentId) {
            $builder->where('department_id', $departmentId);
        }
        $served = $builder->countAllResults(false);

        $builder = $this->where('queue_date', date('Y-m-d'))->where('status', 'skipped');
        if ($departmentId) {
            $builder->where('department_id', $departmentId);
        }
        $skipped = $builder->countAllResults(false);

SELECT `departments`.`name` as `department_name`, `departments`.`code`, `departments`.`color`, COUNT(tickets.id) as total, SUM(CASE WHEN tickets.status = "waiting" THEN 1 ELSE 0 END) as waiting, SUM(CASE WHEN tickets.status = "serving" THEN 1 ELSE 0 END) as serving, SUM(CASE WHEN tickets.status = "served" THEN 1 ELSE 0 END) as served
FROM `tickets`
JOIN `departments` ON `departments`.`id` = `tickets`.`department_id`
WHERE `tickets`.`queue_date` = '2026-05-11'
GROUP BY `tickets`.`department_id`
---
    public function getDepartmentStats()
    {
        return $this->select('departments.name as department_name, departments.code, departments.color,
                             COUNT(tickets.id) as total,
                             SUM(CASE WHEN tickets.status = "waiting" THEN 1 ELSE 0 END) as waiting,
                             SUM(CASE WHEN tickets.status = "serving" THEN 1 ELSE 0 END) as serving,
                             SUM(CASE WHEN tickets.status = "served" THEN 1 ELSE 0 END) as served')
                    ->join('departments', 'departments.id = tickets.department_id')
                    ->where('tickets.queue_date', date('Y-m-d'))
                    ->groupBy('tickets.department_id')
                    ->findAll();

SELECT `tickets`.*, `departments`.`name` as `department_name`, `departments`.`code` as `department_code`, `departments`.`color`, `counters`.`name` as `counter_name`, `services`.`name` as `service_name`
FROM `tickets`
JOIN `departments` ON `departments`.`id` = `tickets`.`department_id`
LEFT JOIN `counters` ON `counters`.`id` = `tickets`.`counter_id`
LEFT JOIN `services` ON `services`.`id` = `tickets`.`service_id`
WHERE `tickets`.`queue_date` = '2026-05-11'
AND `tickets`.`status` = 'serving'
ORDER BY `departments`.`name` ASC
---
    public function getAllCurrentlyServing()
    {
        return $this->select('tickets.*, departments.name as department_name, departments.code as department_code, departments.color,
                             counters.name as counter_name, services.name as service_name')
                    ->join('departments', 'departments.id = tickets.department_id')
                    ->join('counters', 'counters.id = tickets.counter_id', 'left')
                    ->join('services', 'services.id = tickets.service_id', 'left')
                    ->where('tickets.queue_date', date('Y-m-d'))
                    ->where('tickets.status', 'serving')
                    ->orderBy('departments.name', 'ASC')
                    ->findAll();

SELECT `tickets`.*, `departments`.`name` as `department_name`, `departments`.`code` as `department_code`, `services`.`name` as `service_name`, `users`.`full_name` as `staff_name`, `counters`.`name` as `counter_name`
FROM `tickets`
JOIN `departments` ON `departments`.`id` = `tickets`.`department_id`
LEFT JOIN `services` ON `services`.`id` = `tickets`.`service_id`
LEFT JOIN `users` ON `users`.`id` = `tickets`.`served_by`
LEFT JOIN `counters` ON `counters`.`id` = `tickets`.`counter_id`
WHERE `tickets`.`queue_date` >= '2026-05-11'
AND `tickets`.`queue_date` <= '2026-05-11'
ORDER BY `tickets`.`queue_date` DESC, `tickets`.`issued_at` DESC
---
    public function getReport($dateFrom, $dateTo, $departmentId = null)
    {
        $builder = $this->select('tickets.*, departments.name as department_name, departments.code as department_code,
                                  services.name as service_name, users.full_name as staff_name, counters.name as counter_name')
                        ->join('departments', 'departments.id = tickets.department_id')
                        ->join('services', 'services.id = tickets.service_id', 'left')
                        ->join('users', 'users.id = tickets.served_by', 'left')
                        ->join('counters', 'counters.id = tickets.counter_id', 'left')
                        ->where('tickets.queue_date >=', $dateFrom)
                        ->where('tickets.queue_date <=', $dateTo);

        if ($departmentId) {
            $builder->where('tickets.department_id', $departmentId);
        }

        return $builder->orderBy('tickets.queue_date', 'DESC')
                       ->orderBy('tickets.issued_at', 'DESC')
                       ->findAll();

SELECT `tickets`.*, `counters`.`name` as `counter_name`
FROM `tickets`
LEFT JOIN `counters` ON `counters`.`id` = `tickets`.`counter_id`
WHERE `tickets`.`department_id` = '6'
AND `tickets`.`queue_date` = '2026-05-11'
AND `tickets`.`status` IN ('served','skipped')
ORDER BY `tickets`.`completed_at` DESC
 LIMIT 5
---
    public function getRecentServed($departmentId, $limit = 5)
    {
        return $this->select('tickets.*, counters.name as counter_name')
                    ->join('counters', 'counters.id = tickets.counter_id', 'left')
                    ->where('tickets.department_id', $departmentId)
                    ->where('tickets.queue_date', date('Y-m-d'))
                    ->whereIn('tickets.status', ['served', 'skipped'])
                    ->orderBy('tickets.completed_at', 'DESC')
                    ->limit($limit)
                    ->findAll();