app/Models/UserModel.php

    public function getUsersWithDepartment()
    {
        return $this->select('users.*, departments.name as department_name')
                    ->join('departments', 'departments.id = users.department_id', 'left')
                    ->orderBy('users.full_name', 'ASC')
                    ->findAll();
---
SELECT `users`.*, `departments`.`name` as `department_name`
FROM `users`
LEFT JOIN `departments` ON `departments`.`id` = `users`.`department_id`
ORDER BY `users`.`full_name` ASC